ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
/***************************************************************************//**
* \file cy_ble_event_handler.h
* \version 2.0
*
* \brief
*  Contains the prototypes and constants used in the Event Handler State Machine
*  of the BLE Component.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#ifndef CY_BLE_EVENT_HANDLER_H
#define CY_BLE_EVENT_HANDLER_H

#include "cy_ble_gatt.h"
#include "cy_ble_hal_pvt.h"
#include "flash/cy_flash.h"

#if (CY_BLE_MODE_PROFILE)

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/***************************************
* Service specific includes
***************************************/

#ifdef CY_BLE_ANCS
    #include "cy_ble_ancs.h"
#endif /* CY_BLE_ANCS */
#ifdef CY_BLE_ANS
    #include "cy_ble_ans.h"
#endif /* CY_BLE_ANS */
#ifdef CY_BLE_AIOS
    #include "cy_ble_aios.h"
#endif /* CY_BLE_AIOS */
#ifdef CY_BLE_BAS
    #include "cy_ble_bas.h"
#endif /* CY_BLE_BAS */
#ifdef CY_BLE_BLS
    #include "cy_ble_bls.h"
#endif /* CY_BLE_BLS */
#ifdef CY_BLE_BCS
    #include "cy_ble_bcs.h"
#endif /* CY_BLE_BCS */
#ifdef CY_BLE_BMS
    #include "cy_ble_bms.h"
#endif /* CY_BLE_BMS */
#ifdef CY_BLE_BTS
    #include "cy_ble_bts.h"
#endif /* CY_BLE_BTS */
#ifdef CY_BLE_CGMS
    #include "cy_ble_cgms.h"
#endif /* CY_BLE_CGMS */
#ifdef CY_BLE_CPS
    #include "cy_ble_cps.h"
#endif /* CY_BLE_CPS */
#ifdef CY_BLE_CSCS
    #include "cy_ble_cscs.h"
#endif /* CY_BLE_CSCS */
#ifdef CY_BLE_CTS
    #include "cy_ble_cts.h"
#endif /* CY_BLE_CTS */
#ifdef CY_BLE_CUSTOM
    #include "cy_ble_custom.h"
#endif /* CY_BLE_CUSTOM */
#ifdef CY_BLE_DIS
    #include "cy_ble_dis.h"
#endif /* CY_BLE_DIS */
#ifdef CY_BLE_ESS
    #include "cy_ble_ess.h"
#endif /* CY_BLE_ESS */
#ifdef CY_BLE_GLS
    #include "cy_ble_gls.h"
#endif /* CY_BLE_GLS */
#ifdef CY_BLE_HIDS
    #include "cy_ble_hids.h"
#endif /* CY_BLE_HIDS */
#ifdef CY_BLE_HPS
    #include "cy_ble_hps.h"
#endif /* CY_BLE_HPS */
#ifdef CY_BLE_HRS
    #include "cy_ble_hrs.h"
#endif /* CY_BLE_HRS */
#ifdef CY_BLE_HTS
    #include "cy_ble_hts.h"
#endif /* CY_BLE_HTS */
#ifdef CY_BLE_IAS
    #include "cy_ble_ias.h"
#endif /* CY_BLE_IAS */
#ifdef CY_BLE_IPS
    #include "cy_ble_ips.h"
#endif /* CY_BLE_IPS */
#ifdef CY_BLE_LLS
    #include "cy_ble_lls.h"
#endif /* CY_BLE_LLS */
#ifdef CY_BLE_LNS
    #include "cy_ble_lns.h"
#endif /* CY_BLE_LNS */
#ifdef CY_BLE_NDCS
    #include "cy_ble_ndcs.h"
#endif /* CY_BLE_NDCS */
#ifdef CY_BLE_PASS
    #include "cy_ble_pass.h"
#endif /* CY_BLE_PASS */
#ifdef CY_BLE_PLXS
    #include "cy_ble_plxs.h"
#endif /* CY_BLE_PLXS */
#ifdef CY_BLE_RSCS
    #include "cy_ble_rscs.h"
#endif /* CY_BLE_RSCS */
#ifdef CY_BLE_RTUS
    #include "cy_ble_rtus.h"
#endif /* CY_BLE_RTUS */
#ifdef CY_BLE_SCPS
    #include "cy_ble_scps.h"
#endif /* CY_BLE_SCPS */
#ifdef CY_BLE_TPS
    #include "cy_ble_tps.h"
#endif /* CY_BLE_TPS */
#ifdef CY_BLE_UDS
    #include "cy_ble_uds.h"
#endif /* CY_BLE_UDS */
#ifdef CY_BLE_WPTS
    #include "cy_ble_wpts.h"
#endif /* CY_BLE_WPTS */
#ifdef CY_BLE_WSS
    #include "cy_ble_wss.h"
#endif /* CY_BLE_WSS */



/***************************************
* Definitions
***************************************/
/* cy_ble_eventHandlerFlag defines */
#define CY_BLE_CALLBACK                   (0x01u)
#define CY_BLE_AUTO_DISCOVERY             (0x02u)
#define CY_BLE_START_FLAG                 (0x04u)
#define CY_BLE_STOP_FLAG                  (0x08u)
#define CY_BLE_ENABLE_ALL_EVENTS          (0x10u)
#define CY_BLE_DISABLE_AUTOMATIC_AUTH     (0x20u)

#if (CY_BLE_GATT_ROLE_CLIENT)
#define CY_BLE_DISC_SRVC_INFO_LEN         (4u + CY_BLE_GATT_16_BIT_UUID_SIZE)
#define CY_BLE_DISC_SRVC_INFO_128_LEN     (4u + CY_BLE_GATT_128_BIT_UUID_SIZE)
#define CY_BLE_DISC_INCL_INFO_LEN         (6u + CY_BLE_GATT_16_BIT_UUID_SIZE)
#define CY_BLE_DISC_INCL_INFO_128_LEN     (6u)
#define CY_BLE_DISC_CHAR_INFO_LEN         (5u + CY_BLE_GATT_16_BIT_UUID_SIZE)
#define CY_BLE_DISC_CHAR_INFO_128_LEN     (5u + CY_BLE_GATT_128_BIT_UUID_SIZE)
#define CY_BLE_DISC_DESCR_INFO_LEN        (2u + CY_BLE_GATT_16_BIT_UUID_SIZE)
#define CY_BLE_DISC_DESCR_INFO_128_LEN    (2u + CY_BLE_GATT_128_BIT_UUID_SIZE)
#endif /* CY_BLE_GATT_ROLE_CLIENT */

#define CY_BLE_LE_MASK_LENGTH             (0x8u)
#define CY_BLE_LE_MASK_DEFAULT            (0x003Fu)
#define CY_BLE_LE_MASK_DLE                ((CY_BLE_DLE_FEATURE_ENABLED) ?          (0x0040u) : (0u))
#define CY_BLE_LE_MASK_SECURE_CONN        ((CY_BLE_SECURE_CONN_FEATURE_ENABLED) ?  (0x0180u) : (0u))
#define CY_BLE_LE_MASK_LL_PRIVACY         ((CY_BLE_LL_PRIVACY_FEATURE_ENABLED) ?   (0x0600u) : (0u))
#define CY_BLE_LE_MASK_PHY                ((CY_BLE_PHY_UPDATE_FEATURE_ENABLED) ?   (0x0800u) : (0u))
#define CY_BLE_LE_MASK                    (CY_BLE_LE_MASK_DEFAULT | CY_BLE_LE_MASK_DLE | CY_BLE_LE_MASK_LL_PRIVACY \
                                           | CY_BLE_LE_MASK_SECURE_CONN | CY_BLE_LE_MASK_PHY)
/* Internal command run status defines */
#define CY_BLE_STATUS_SET_TX_PWR_LVL      (uint32_t)(1ul << 0u)

/***************************************
* Type Definitions
***************************************/

/**
 * \addtogroup group_ble_service_api_events
 * @{
 */


/** Service specific events  */
typedef enum
{
    /****************************************
     * Security Events
     ***************************************/
    /* \cond IGNORE */

    CY_BLE_AUTHENTICATION_REQUEST_REPLY = CY_BLE_EVT_MAX + 1, /* 0x10000 */
    CY_BLE_PASSKEY_ENTRY_REQUEST_REPLY,
    CY_BLE_LONG_TERM_KEY_REQUEST_REPLY,
    CY_BLE_KEY_EXCHANGE_INFO_REQUEST_REPLY,
    /* \endcond */

    /****************************************
     * GATT Service Events
     ***************************************/

    /** GATT Server - This event indicates that the CCCD data CRC is wrong.
     *  If this event occurs, removing the bonding information of all devices
     *  by using the Cy_BLE_GAP_RemoveBondedDevice() API is recommended.
     *  The CCCD buffer in the RAM for the current connection is cleaned (set to zero) 
     *  The event parameter is NULL.
     */
    CY_BLE_EVT_GATTS_EVT_CCCD_CORRUPT,

