ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** GATT Server - Indication for GATT Service's "Service Changed"
     *  Characteristic was enabled. The parameter of this event is a structure of
     *  cy_stc_ble_gatts_write_cmd_req_param_t type.
     */
    CY_BLE_EVT_GATTS_INDICATION_ENABLED,

    /** GATT Server - Indication for GATT Service's "Service Changed"
     *  Characteristic was disabled. The parameter of this event is a structure of
     *  cy_stc_ble_gatts_write_cmd_req_param_t type.
     */
    CY_BLE_EVT_GATTS_INDICATION_DISABLED,

    /** GATT Client - GATT Service's "Service Changed" Characteristic Indication
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_gattc_handle_value_ind_param_t type.
     */
    CY_BLE_EVT_GATTC_INDICATION,


    /****************************************
     * Service Discovery Events
     ***************************************/

    /** GATT Client - The Service discovery procedure failed. This event may
     *  be generated on calling Cy_BLE_GATTC_DiscoverPrimaryServices().
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_SRVC_DISCOVERY_FAILED,

    /** GATT Client - The discovery of included services failed. This event may
     *  be generated on calling Cy_BLE_GATTC_FindIncludedServices().
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_INCL_DISCOVERY_FAILED,

    /** GATT Client - The discovery of the service's characteristics failed. This event may
     *  be generated on calling Cy_BLE_GATTC_DiscoverCharacteristics() or
     *  Cy_BLE_GATTC_ReadUsingCharacteristicUuid().
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_CHAR_DISCOVERY_FAILED,

    /** GATT Client - The discovery of the service's characteristics failed. This event may
     *  be generated on calling Cy_BLE_GATTC_DiscoverCharacteristicDescriptors().
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_DESCR_DISCOVERY_FAILED,

    /** GATT Client - A duplicate service record was found during the server device
     *  discovery. The parameter of this event is a structure of cy_stc_ble_disc_srv_info_t
     *  type.
     */
    CY_BLE_EVT_GATTC_SRVC_DUPLICATION,

    /** GATT Client - Duplicate service's characteristic record was found during
     *  server device discovery. The parameter of this event is a structure
     *  of cy_stc_ble_disc_char_info_t type.
     */
    CY_BLE_EVT_GATTC_CHAR_DUPLICATION,

    /** GATT Client - A duplicate service's characteristic descriptor record was found
     *  during server device discovery. The parameter of this event is a structure
     *  of cy_stc_ble_disc_descr_info_t type.
     */
    CY_BLE_EVT_GATTC_DESCR_DUPLICATION,

    /** GATT Client - The Service discovery procedure completed successfully. This
     *  event may be generated on calling Cy_BLE_GATTC_DiscoverPrimaryServices().
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_SRVC_DISCOVERY_COMPLETE,

    /** GATT Client - The included services discovery is completed
     *  successfully. This event may be generated on calling
     *  Cy_BLE_GATTC_FindIncludedServices().
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_INCL_DISCOVERY_COMPLETE,

    /** GATT Client - The discovery of service's characteristics discovery is completed
     *  successfully. This event may be generated on calling
     *  Cy_BLE_GATTC_DiscoverCharacteristics() or
     *  Cy_BLE_GATTC_ReadUsingCharacteristicUuid().
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_CHAR_DISCOVERY_COMPLETE,
    
    /** GATT Client - The service (not defined in the GATT database) was found during
    *  the server device discovery. The discovery procedure skips this service.
    *  This event parameter is a structure of the cy_stc_ble_disc_srv_info_t type.
    */
    CY_BLE_EVT_GATTC_DISC_SKIPPED_SERVICE,
                    
    /** GATT Client - The discovery of a remote device completed successfully.
     *  The parameter of this event is a structure of the cy_stc_ble_conn_handle_t type.
     */
    CY_BLE_EVT_GATTC_DISCOVERY_COMPLETE,

    /****************************************
     * AIOS Service Events
     ***************************************/

    /** AIOS Server - Notification for Automation Input Output Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSS_NOTIFICATION_ENABLED,

    /** AIOS Server - Notification for Automation Input Output Service Characteristic
     *  was disabled. The parameter of this event is a structure of
     *  cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSS_NOTIFICATION_DISABLED,

    /** AIOS Server - Indication for Automation Input Output Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSS_INDICATION_ENABLED,

    /** AIOSS Server - Indication for Automation Input Output Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSS_INDICATION_DISABLED,

    /** AIOS Server - Automation Input Output Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSS_INDICATION_CONFIRMED,

    /** AIOS Server - Write Request for Automation Input Output Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSS_WRITE_CHAR,

