ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** AIOSS Server - Write Request for Automation Input Output Service
     *  Characteristic Descriptor was received. The parameter of this event is a structure of
     *  cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSS_DESCR_WRITE,

    /** AIOS Client - Automation Input Output Characteristic Service Notification
     *  was received. The parameter of this event is a structure
     *  of cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSC_NOTIFICATION,

    /** AIOS Client - Automation Input Output Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSC_INDICATION,

    /** AIOS Client - Read Response for Read Request for Automation Input Output Service Characteristic
     *  Value. The parameter of this event is a structure of
     *  cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSC_READ_CHAR_RESPONSE,

    /** AIOS Client - Write Response for Write Request for Automation Input Output Service
     *  Characteristic Value. The parameter of this event is a structure of
     *  cy_stc_ble_aios_char_value_t type.
     */
    CY_BLE_EVT_AIOSC_WRITE_CHAR_RESPONSE,

    /** AIOS Client - Read Response for Read Request for Automation Input Output Service
     *  Characteristic Descriptor Read Request. The parameter of this event is a
     *  structure of cy_stc_ble_aios_descr_value_t type.
     */
    CY_BLE_EVT_AIOSC_READ_DESCR_RESPONSE,

    /** AIOS Client - Write Response for Write Request for Automation Input Output Service
     *  Client Characteristic Configuration Descriptor Value. The parameter of
     *  this event is a structure of cy_stc_ble_aios_descr_value_t type.
     */
    CY_BLE_EVT_AIOSC_WRITE_DESCR_RESPONSE,

    /** AIOS Client - Error Response for Write Request for Automation Input Output Service
     *  Characteristic Value. The parameter of this event is a structure of
     *  cy_stc_ble_ancs_char_value_t type.
     */
    CY_BLE_EVT_AIOSC_ERROR_RESPONSE,

    /****************************************
     * ANCS Service Events
     ***************************************/

    /** ANCS Server - Notification for Apple Notification Center Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_ancs_char_value_t type.
     */
    CY_BLE_EVT_ANCSS_NOTIFICATION_ENABLED,

    /** ANCS Server - Notification for Apple Notification Center Service Characteristic
     *  was disabled. The parameter of this event is a structure of
     *  the cy_stc_ble_ancs_char_value_t type.
     */
    CY_BLE_EVT_ANCSS_NOTIFICATION_DISABLED,

    /** ANCS Server - Write Request for Apple Notification Center Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_ancs_char_value_t type.
     */
    CY_BLE_EVT_ANCSS_WRITE_CHAR,

    /** ANCS Client - Apple Notification Center Characteristic Service Notification
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_ancs_char_value_t type.
     */
    CY_BLE_EVT_ANCSC_NOTIFICATION,

    /** ANCS Client - Write Response for Write Request for Apple Notification Center Service
     *  Characteristic Value. The parameter of this event is a structure of
     *  cy_stc_ble_ancs_char_value_t type.
     */
    CY_BLE_EVT_ANCSC_WRITE_CHAR_RESPONSE,

    /** ANCS Client - Read Response for Read Request for Apple Notification Center Service
     *  Characteristic Descriptor Read Request. The parameter of this event is a
     *  structure of the cy_stc_ble_ancs_descr_value_t type.
     */
    CY_BLE_EVT_ANCSC_READ_DESCR_RESPONSE,

    /** ANCS Client - Write Response for Write Request for Apple Notification Center Service
     *  Client Characteristic Configuration Descriptor Value. The parameter of
     *  this event is a structure of the cy_stc_ble_ancs_descr_value_t type.
     */
    CY_BLE_EVT_ANCSC_WRITE_DESCR_RESPONSE,

    /** ANCS Client - Error Response for Write Request for Apple Notification Center Service
     *  Characteristic Value. The parameter of this event is a structure of
     *  the cy_stc_ble_ancs_char_value_t type.
     */
    CY_BLE_EVT_ANCSC_ERROR_RESPONSE,


    /****************************************
     * ANS Service Events
     ***************************************/

    /** ANS Server - Notification for Alert Notification Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_ans_char_value_t type.
     */
    CY_BLE_EVT_ANSS_NOTIFICATION_ENABLED,

    /** ANS Server - Notification for Alert Notification Service Characteristic
     *  was disabled. The parameter of this event is a structure of
     *  the cy_stc_ble_ans_char_value_t type.
     */
    CY_BLE_EVT_ANSS_NOTIFICATION_DISABLED,

    /** ANS Server - Write Request for Alert Notification Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_ans_char_value_t type.
     */
    CY_BLE_EVT_ANSS_WRITE_CHAR,

    /** ANS Client - Alert Notification Characteristic Service Notification
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_ans_char_value_t type.
     */
    CY_BLE_EVT_ANSC_NOTIFICATION,

    /** ANS Client - Read Response for Alert Notification Service Characteristic
     *  Value. The parameter of this event is a structure of
     *  the cy_stc_ble_ans_char_value_t type.
     */
    CY_BLE_EVT_ANSC_READ_CHAR_RESPONSE,

    /** ANS Client - Write Response for Write Request for Alert Notification Service
     *  Characteristic Value. The parameter of this event is a structure of
     *  the cy_stc_ble_ans_char_value_t type.
     */
    CY_BLE_EVT_ANSC_WRITE_CHAR_RESPONSE,

    /** ANS Client - Read Response for Read Request for Alert Notification Service
     *  Characteristic Descriptor Read Request. The parameter of this event is a
     *  structure of the cy_stc_ble_ans_descr_value_t type.
     */
    CY_BLE_EVT_ANSC_READ_DESCR_RESPONSE,

    /** ANS Client - Write Response for Write Request for Alert Notification Service
     *  Client Characteristic Configuration Descriptor Value. The parameter of
     *  this event is a structure of the cy_stc_ble_ans_descr_value_t type.
     */
    CY_BLE_EVT_ANSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * BAS Service Events
     ***************************************/

