ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** BAS Server - Notification for Battery Level Characteristic was enabled. The
     *  parameter of this event is a structure of the cy_stc_ble_bas_char_value_t type.
     */
    CY_BLE_EVT_BASS_NOTIFICATION_ENABLED,

    /** BAS Server - Notification for Battery Level Characteristic was disabled. The
     *  parameter of this event is a structure of the cy_stc_ble_bas_char_value_t type.
     */
    CY_BLE_EVT_BASS_NOTIFICATION_DISABLED,

    /** BAS Client - Battery Level Characteristic Notification was received. The
     *  parameter of this event is a structure of the cy_stc_ble_bas_char_value_t type.
     */
    CY_BLE_EVT_BASC_NOTIFICATION,

    /** BAS Client - Read Response for Battery Level Characteristic Value. The
     *  parameter of this event is a structure of the cy_stc_ble_bas_char_value_t type.
     */
    CY_BLE_EVT_BASC_READ_CHAR_RESPONSE,

    /** BAS Client - Read Response for Battery Level Characteristic Descriptor Read
     *  Request. The parameter of this event is a structure of
     *  the cy_stc_ble_bas_descr_value_t type.
     */
    CY_BLE_EVT_BASC_READ_DESCR_RESPONSE,

    /** BAS Client - Write Response for Battery Level Client Characteristic
     *  Configuration Descriptor Value. The parameter of this event is a structure of
     *  the cy_stc_ble_bas_descr_value_t type.
     */
    CY_BLE_EVT_BASC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Body Composition Service Events
     ***************************************/

    /** BCS Server - Indication for Body Composition Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_bcs_char_value_t type.
     */
    CY_BLE_EVT_BCSS_INDICATION_ENABLED,

    /** BCS Server - Indication for Body Composition Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_bcs_char_value_t type.
     */
    CY_BLE_EVT_BCSS_INDICATION_DISABLED,

    /** BCS Server - Body Composition Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_bcs_char_value_t type.
     */
    CY_BLE_EVT_BCSS_INDICATION_CONFIRMED,

    /** BCS Client - Body Composition Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_bcs_char_value_t type.
     */
    CY_BLE_EVT_BCSC_INDICATION,

    /** BCS Client - Read Response for Read Request of Body Composition
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_bcs_char_value_t type.
     */
    CY_BLE_EVT_BCSC_READ_CHAR_RESPONSE,

    /** BCS Client - Read Response for Read Request of Body Composition
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_bcs_descr_value_t type.
     */
    CY_BLE_EVT_BCSC_READ_DESCR_RESPONSE,

    /** BCS Client - Write Response for Write Request of Body Composition
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_bcs_descr_value_t type.
     */
    CY_BLE_EVT_BCSC_WRITE_DESCR_RESPONSE,

    /****************************************
     * Blood Pressure Service Events
     ***************************************/

    /** BLS Server - Indication for Blood Pressure Service Characteristic was enabled.
     *  The parameter of this event is a structure of the cy_stc_ble_bls_char_value_t type.
     */
    CY_BLE_EVT_BLSS_INDICATION_ENABLED,

    /** BLS Server - Indication for Blood Pressure Service Characteristic was
     *  disabled. The parameter of this event is a structure of
     *  the cy_stc_ble_bls_char_value_t type.
     */
    CY_BLE_EVT_BLSS_INDICATION_DISABLED,

    /** BLS Server - Blood Pressure Service Characteristic Indication was confirmed.
     *  The parameter of this event is a structure of cy_stc_ble_bls_char_value_t type
     */
    CY_BLE_EVT_BLSS_INDICATION_CONFIRMED,

    /** BLS Server - Notification for Blood Pressure Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_bls_char_value_t type.
     */
    CY_BLE_EVT_BLSS_NOTIFICATION_ENABLED,

    /** BLS Server - Notification for Blood Pressure Service Characteristic
     *  was disabled. The parameter of this event is a structure of
     *  the cy_stc_ble_bls_char_value_t type.
     */
    CY_BLE_EVT_BLSS_NOTIFICATION_DISABLED,

    /** BLS Client - Blood Pressure Service Characteristic Indication was received.
     *  The parameter of this event is a structure of the cy_stc_ble_bls_char_value_t type.
     */
    CY_BLE_EVT_BLSC_INDICATION,

    /** BLS Client - Blood Pressure Service Characteristic Notification was received.
     *  The parameter of this event is a structure of the cy_stc_ble_bls_char_value_t type.
     */
    CY_BLE_EVT_BLSC_NOTIFICATION,

    /** BLS Client - Read Response for Read Request of Blood Pressure Service
     *  Characteristic value. The parameter of this event is a structure of
     *  the cy_stc_ble_bls_char_value_t type.
     */
    CY_BLE_EVT_BLSC_READ_CHAR_RESPONSE,

    /** BLS Client - Read Response for Read Request of Blood Pressure Service
     *  Characteristic Descriptor Read request. The parameter of this event is a
     *  structure of the cy_stc_ble_bls_descr_value_t type.
     */
    CY_BLE_EVT_BLSC_READ_DESCR_RESPONSE,

    /** BLS Client - Write Response for Write Request of Blood Pressure Service
     *  Characteristic Configuration Descriptor value. The parameter of this event
     *  is a structure of the cy_stc_ble_bls_descr_value_t type.
     */
    CY_BLE_EVT_BLSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Bond Management Service Events
     ***************************************/

    /** BMS Server - Write Request for Bond Management
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_bms_char_value_t type.
     */
    CY_BLE_EVT_BMSS_WRITE_CHAR,

