ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** BMS Client - Read Response for Read Request of Bond Management Service
     *  Characteristic value. The parameter of this event is a structure of
     *  the cy_stc_ble_bms_char_value_t type.
     */
    CY_BLE_EVT_BMSC_READ_CHAR_RESPONSE,

    /** BMS Client - Write Response for Write Request of Bond Management
     *  Service Characteristic value. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_bms_char_value_t type.
     */
    CY_BLE_EVT_BMSC_WRITE_CHAR_RESPONSE,

    /** BMS Client - Read Response for Read Request of Bond Management Service
     *  Characteristic Descriptor Read request. The parameter of this event is a
     *  structure of cy_stc_ble_bms_descr_value_t type.
     */
    CY_BLE_EVT_BMSC_READ_DESCR_RESPONSE,


    /****************************************
     * CGM Service Events
     ***************************************/

    /** CGMS Server - Indication for Continuous Glucose Monitoring Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSS_INDICATION_ENABLED,

    /** CGMS Server - Indication for Continuous Glucose Monitoring Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSS_INDICATION_DISABLED,

    /** CGMS Server - Continuous Glucose Monitoring Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSS_INDICATION_CONFIRMED,

    /** CGMS Server - Notification for Continuous Glucose Monitoring Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSS_NOTIFICATION_ENABLED,

    /** CGMS Server - Notification for Continuous Glucose Monitoring Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSS_NOTIFICATION_DISABLED,

    /** CGMS Server - Write Request for Continuous Glucose Monitoring Service
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSS_WRITE_CHAR,

    /** CGMS Client - Continuous Glucose Monitoring Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSC_INDICATION,

    /** CGMS Client - Continuous Glucose Monitoring Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSC_NOTIFICATION,

    /** CGMS Client - Read Response for Read Request of Continuous Glucose Monitoring
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSC_READ_CHAR_RESPONSE,

    /** CGMS Client - Write Response for Write Request of Continuous Glucose Monitoring
     *  Service Characteristic value. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_cgms_char_value_t type.
     */
    CY_BLE_EVT_CGMSC_WRITE_CHAR_RESPONSE,

    /** CGMS Client - Read Response for Read Request of Continuous Glucose Monitoring
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_cgms_descr_value_t type.
     */
    CY_BLE_EVT_CGMSC_READ_DESCR_RESPONSE,

    /** CGMS Client - Write Response for Write Request of Continuous Glucose Monitoring
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_cgms_descr_value_t type.
     */
    CY_BLE_EVT_CGMSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * CPS Service Events
     ***************************************/

    /** CPS Server - Notification for Cycling Power Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_NOTIFICATION_ENABLED,

    /** CPS Server - Notification for Cycling Power Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_NOTIFICATION_DISABLED,

    /** CPS Server - Indication for Cycling Power Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_INDICATION_ENABLED,

    /** CPS Server - Indication for Cycling Power Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_INDICATION_DISABLED,

    /** CPS Server - Cycling Power Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_INDICATION_CONFIRMED,

    /** CPS Server - Broadcast for Cycling Power Service Characteristic
     *  was enabled. The parameter of this event
     *  is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_BROADCAST_ENABLED,

    /** CPS Server - Broadcast for Cycling Power Service Characteristic
     *  was disabled. The parameter of this event
     *  is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_BROADCAST_DISABLED,

    /** CPS Server - Write Request for Cycling Power Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSS_WRITE_CHAR,

