ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** CPS Client - Cycling Power Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSC_NOTIFICATION,

    /** CPS Client - Cycling Power Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSC_INDICATION,

    /** CPS Client - Read Response for Read Request of Cycling Power Service
     *  Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSC_READ_CHAR_RESPONSE,

    /** CPS Client - Write Response for Write Request of Cycling Power Service
     *  Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSC_WRITE_CHAR_RESPONSE,

    /** CPS Client - Read Response for Read Request of Cycling Power
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_cps_descr_value_t type.
     */
    CY_BLE_EVT_CPSC_READ_DESCR_RESPONSE,

    /** CPS Client - Write Response for Write Request of Cycling Power
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_cps_descr_value_t type.
     */
    CY_BLE_EVT_CPSC_WRITE_DESCR_RESPONSE,

    /** CPS Client - This event is triggered every time a device receive
     *  non-connectable undirected advertising event.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSC_SCAN_PROGRESS_RESULT,

    /** CPS Client - Cycling Power CP procedure timeout was received. The parameter
     *  of this event is a structure of the cy_stc_ble_cps_char_value_t type.
     */
    CY_BLE_EVT_CPSC_TIMEOUT,

    /****************************************
     * Cycling Speed and Cadence Service Events
     ***************************************/

    /** CSCS Server - Notification for Cycling Speed and Cadence Service
     *  Characteristic was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSS_NOTIFICATION_ENABLED,

    /** CSCS Server - Notification for Cycling Speed and Cadence Service
     *  Characteristic was disabled. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSS_NOTIFICATION_DISABLED,

    /** CSCS Server - Indication for Cycling Speed and Cadence Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSS_INDICATION_ENABLED,

    /** CSCS Server - Indication for Cycling Speed and Cadence Service Characteristic
     *  was disabled. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSS_INDICATION_DISABLED,

    /** CSCS Server - Cycling Speed and Cadence Service Characteristic
     *  Indication was confirmed. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSS_INDICATION_CONFIRMATION,

    /** CSCS Server - Write Request for Cycling Speed and Cadence Service
     *  Characteristic was received. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSS_WRITE_CHAR,

    /** CSCS Client - Cycling Speed and Cadence Service Characteristic
     *  Notification was received. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSC_NOTIFICATION,

    /** CSCS Client - Cycling Speed and Cadence Service Characteristic
     *  Indication was received. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSC_INDICATION,

    /** CSCS Client - Read Response for Read Request of Cycling Speed and Cadence
     *  Service Characteristic value. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSC_READ_CHAR_RESPONSE,

    /** CSCS Client - Write Response for Write Request of Cycling Speed and Cadence
     *  Service Characteristic value. The parameter of this event is a structure of
     *  the cy_stc_ble_cscs_char_value_t type.
     */
    CY_BLE_EVT_CSCSC_WRITE_CHAR_RESPONSE,

    /** CSCS Client - Read Response for Read Request of Cycling Speed and Cadence
     *  Service Characteristic Descriptor Read request. The parameter of this event
     *  is a structure of the cy_stc_ble_cscs_descr_value_t type.
     */
    CY_BLE_EVT_CSCSC_READ_DESCR_RESPONSE,

    /** CSCS Client - Write Response for Write Request of Cycling Speed and Cadence
     *  Service Characteristic Configuration Descriptor value. The parameter of
     *  this event is a structure of  the cy_stc_ble_cscs_descr_value_t type.
     */
    CY_BLE_EVT_CSCSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Current Time Service Events
     ***************************************/

    /** CTS Server - Notification for Current Time Characteristic was enabled. The
     *  parameter of this event is a structure of the cy_stc_ble_cts_char_value_t type.
     */
    CY_BLE_EVT_CTSS_NOTIFICATION_ENABLED,

    /** CTS Server - Notification for Current Time Characteristic was disabled. The
     *  parameter of this event is a structure of the cy_stc_ble_cts_char_value_t type.
     */
    CY_BLE_EVT_CTSS_NOTIFICATION_DISABLED,

    /** CTS Server - Write Request for Current Time Service
     *  Characteristic was received. The parameter of this event is a structure of
     *  the cy_stc_ble_cts_char_value_t type. When this event is received, the user is
     *  responsible for performing any kind of data verification and writing the
     *  data to the GATT database in case of successful verification or setting
     *  the error using Cy_BLE_SetGattError() if data verification fails.
     */
    CY_BLE_EVT_CTSS_WRITE_CHAR,

    /** CTS Client - Current Time Characteristic Notification was received. The
     *  parameter of this event is a structure of the cy_stc_ble_cts_char_value_t type.
     */
    CY_BLE_EVT_CTSC_NOTIFICATION,

