ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** CTS Client - Read Response for Current Time Characteristic
     *  Value Read Request. The parameter of this event is a
     *  structure of the cy_stc_ble_cts_char_value_t type.
     */
    CY_BLE_EVT_CTSC_READ_CHAR_RESPONSE,

    /** CTS Client - Read Response for Current Time Client
     *  Characteristic Configuration Descriptor Value Read
     *  Request. The parameter of this event is a
     *  structure of the cy_stc_ble_cts_descr_value_t type.
     */
    CY_BLE_EVT_CTSC_READ_DESCR_RESPONSE,

    /** CTS Client - Write Response for Current Time Characteristic
     *  Configuration Descriptor Value. The parameter of this
     *  event is a structure of the cy_stc_ble_cts_descr_value_t type.
     */
    CY_BLE_EVT_CTSC_WRITE_DESCR_RESPONSE,

    /** CTS Client - Write Response for Current Time or Local
     *  Time Information Characteristic Value. The parameter of this
     *  event is a structure of the cy_stc_ble_cts_descr_value_t type.
     */
    CY_BLE_EVT_CTSC_WRITE_CHAR_RESPONSE,

    /****************************************
     * DIS Service Events
     ***************************************/

    /** DIS Client - Read Response for a Read Request for a
     *  Device Information Service Characteristic. The parameter of this
     *  event is a structure of the cy_stc_ble_dis_char_value_t type.
     */
    CY_BLE_EVT_DISC_READ_CHAR_RESPONSE,


    /****************************************
     * Environmental Sensing Service Events
     ***************************************/

    /** ESS Server - Notification for Environmental Sensing Service
     *  Characteristic was enabled. The parameter of this event is a structure of
     *  cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSS_NOTIFICATION_ENABLED,

    /** ESS Server - Notification for Environmental Sensing Service
     *  Characteristic was disabled. The parameter of this event is a structure of
     *  cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSS_NOTIFICATION_DISABLED,

    /** ESS Server - Indication for Environmental Sensing Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSS_INDICATION_ENABLED,

    /** ESS Server - Indication for Environmental Sensing Service Characteristic
     *  was disabled. The parameter of this event is a structure of
     *  cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSS_INDICATION_DISABLED,

    /** ESS Server - Environmental Sensing Service Characteristic
     *  Indication was confirmed. The parameter of this event is a structure of
     *  cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSS_INDICATION_CONFIRMATION,

    /** ESS Server - Write Request for Environmental Sensing Service
     *  Characteristic was received. The parameter of this event is a structure of
     *  the cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSS_WRITE_CHAR,

    /** ESS Server - Write Request for Environmental Sensing Service
     *  Characteristic Descriptor was received. The parameter of this event is a structure of
     *  the cy_stc_ble_ess_descr_value_t type. This event is generated only when write for
     *  CY_BLE_ESS_CHAR_USER_DESCRIPTION_DESCR, CY_BLE_ESS_ES_TRIGGER_SETTINGS_DESCR or
     *  CY_BLE_ESS_ES_CONFIG_DESCR occurs.
     */
    CY_BLE_EVT_ESSS_DESCR_WRITE,

    /** ESS Client - Environmental Sensing Service Characteristic
     *  Notification was received. The parameter of this event is a structure of
     *  the cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSC_NOTIFICATION,

    /** ESS Client - Environmental Sensing Service Characteristic
     *  Indication was received. The parameter of this event is a structure of
     *  cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSC_INDICATION,

    /** ESS Client - Read Response for Read Request of Environmental Sensing
     *  Service Characteristic value. The parameter of this event is a structure of
     *  the cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSC_READ_CHAR_RESPONSE,

    /** ESS Client - Write Response for Write Request of Environmental Sensing
     *  Service Characteristic value. The parameter of this event is a structure of
     *  the cy_stc_ble_ess_char_value_t type.
     */
    CY_BLE_EVT_ESSC_WRITE_CHAR_RESPONSE,

    /** ESS Client - Read Response for Read Request of Environmental Sensing
     *  Service Characteristic Descriptor Read request. The parameter of this event
     *  is a structure of the cy_stc_ble_ess_descr_value_t type.
     */
    CY_BLE_EVT_ESSC_READ_DESCR_RESPONSE,

    /** ESS Client - Write Response for Write Request of Environmental Sensing
     *  Service Characteristic Configuration Descriptor value. The parameter of
     *  this event is a structure of the cy_stc_ble_ess_descr_value_t type.
     */
    CY_BLE_EVT_ESSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Glucose Service Events
     ***************************************/

    /** GLS Server - Indication for Glucose Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSS_INDICATION_ENABLED,

    /** GLS Server - Indication for Glucose Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSS_INDICATION_DISABLED,

    /** GLS Server - Glucose Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSS_INDICATION_CONFIRMED,

    /** GLS Server - Notification for Glucose Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSS_NOTIFICATION_ENABLED,

    /** GLS Server - Notification for Glucose Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSS_NOTIFICATION_DISABLED,

    /** GLS Server - Write Request for Glucose Service
     *  was received. The parameter of this event is a structure
     *  of cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSS_WRITE_CHAR,

    /** GLS Client - Glucose Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSC_INDICATION,

    /** GLS Client - Glucose Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSC_NOTIFICATION,

    /** GLS Client - Read Response for Read Request of Glucose
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSC_READ_CHAR_RESPONSE,

