ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** GLS Client - Write Response for Write Request of Glucose
     *  Service Characteristic value. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_GLSC_WRITE_CHAR_RESPONSE,

    /** GLS Client - Read Response for Read Request of Glucose
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_gls_descr_value_t type.
     */
    CY_BLE_EVT_GLSC_READ_DESCR_RESPONSE,

    /** GLS Client - Write Response for Write Request of Glucose
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_gls_descr_value_t type.
     */
    CY_BLE_EVT_GLSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * HIDS Service Events
     ***************************************/

    /** HIDS Server - Notification for HID service was
     *  enabled. The parameter of this event is a
     *  structure of the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSS_NOTIFICATION_ENABLED,

    /** HIDS Server - Notification for HID service was
     *  disabled. The parameter of this event is a
     *  structure of the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSS_NOTIFICATION_DISABLED,

    /** HIDS Server - Enter boot mode request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSS_BOOT_MODE_ENTER,

    /** HIDS Server - Enter report mode request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSS_REPORT_MODE_ENTER,

    /** HIDS Server - Enter suspend mode request. The
     *  parameter of this event is a structure of
     *  cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSS_SUSPEND,

    /** HIDS Server - Exit suspend mode request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSS_EXIT_SUSPEND,

    /** HIDS Server - Write Report Characteristic
     *  request. The parameter of this event is a
     *  structure of the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSS_REPORT_WRITE_CHAR,

    /** HIDS Client - HID Service Characteristic
     *  Notification was received. The parameter of this
     *  event is a structure of the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSC_NOTIFICATION,

    /** HIDS Client - Read Response for Read Request of HID
     *  Service Characteristic value. The parameter of this
     *  event is a structure of the cy_stc_ble_hids_descr_value_t type.
     */
    CY_BLE_EVT_HIDSC_READ_CHAR_RESPONSE,

    /** HIDS Client - Write Response for Write Request of
     *  HID Service Characteristic value. The parameter
     *  of this event is a structure of
     *  the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSC_WRITE_CHAR_RESPONSE,

    /** HIDS Client - Read Response for Read Request of HID
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_hids_descr_value_t type.
     */
    CY_BLE_EVT_HIDSC_READ_DESCR_RESPONSE,

    /** HIDS Client - Write Response for Write Request of HID
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_hids_char_value_t type.
     */
    CY_BLE_EVT_HIDSC_WRITE_DESCR_RESPONSE,


    /****************************************
     *  HTTP Proxy Service Events
     ***************************************/

    /** HPS Server - Notification for HTTP Proxy Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_hps_char_value_t type.
     */
    CY_BLE_EVT_HPSS_NOTIFICATION_ENABLED,

    /** HPS Server - Notification for HTTP Proxy Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_hps_char_value_t type.
     */
    CY_BLE_EVT_HPSS_NOTIFICATION_DISABLED,

    /** HPS Server - Write Request for HTTP Proxy Service
     *  Characteristic was received. The parameter of this event is a structure of
     *  the cy_stc_ble_hps_char_value_t type.
     */
    CY_BLE_EVT_HPSS_WRITE_CHAR,

    /** HPS Client - HTTP Proxy Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_hps_char_value_t type.
     */
    CY_BLE_EVT_HPSC_NOTIFICATION,

    /** HPS Client - Read Response for Read Request of HTTP Proxy
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_hps_char_value_t type.
     */
    CY_BLE_EVT_HPSC_READ_CHAR_RESPONSE,

    /** HPS Client - Read Response for Read Request of HTTP Proxy
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_hps_descr_value_t type.
     */
    CY_BLE_EVT_HPSC_READ_DESCR_RESPONSE,

    /** HPS Client - Write Response for Write Request of HTTP Proxy
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_hps_descr_value_t type.
     */
    CY_BLE_EVT_HPSC_WRITE_DESCR_RESPONSE,

    /** HPS Client - Write Response for Write Request of HPS
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_hps_char_value_t type.
     */
    CY_BLE_EVT_HPSC_WRITE_CHAR_RESPONSE,

    /****************************************
     * HRS Service Events
     ***************************************/

    /** HRS Server - Reset Energy Expended. The parameter of
     *  this event is a structure of the cy_stc_ble_hrs_char_value_t type.
     */
    CY_BLE_EVT_HRSS_ENERGY_EXPENDED_RESET,

    /** HRS Server - Notification for Heart Rate Measurement
     *  Characteristic was enabled. The parameter of this
     *  event is a structure of the cy_stc_ble_hrs_char_value_t type.
     */

