ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    CY_BLE_EVT_HRSS_NOTIFICATION_ENABLED,

    /** HRS Server - Notification for Heart Rate Measurement
     *  Characteristic was disabled. The parameter of this
     *  event is a structure of the cy_stc_ble_hrs_char_value_t type.
     */
    CY_BLE_EVT_HRSS_NOTIFICATION_DISABLED,

    /** HRS Client - Heart Rate Measurement Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_hrs_char_value_t type.
     */
    CY_BLE_EVT_HRSC_NOTIFICATION,

    /** HRS Client - Read Response for Read Request of HRS
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_hrs_char_value_t type.
     */
    CY_BLE_EVT_HRSC_READ_CHAR_RESPONSE,

    /** HRS Client - Write Response for Write Request of HRS
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_hrs_char_value_t type.
     */
    CY_BLE_EVT_HRSC_WRITE_CHAR_RESPONSE,

    /** HRS Client - Read Response for Read Request of HRS
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_hrs_char_value_t type.
     */
    CY_BLE_EVT_HRSC_READ_DESCR_RESPONSE,

    /** HRS Client - Write Response for Write Request of HRS
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_hrs_char_value_t type.
     */
    CY_BLE_EVT_HRSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * HTS Service Events
     ***************************************/

    /** HTS Server - Notification for Health Thermometer Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSS_NOTIFICATION_ENABLED,

    /** HTS Server - Notification for Health Thermometer Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSS_NOTIFICATION_DISABLED,

    /** HTS Server - Indication for Health Thermometer Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSS_INDICATION_ENABLED,

    /** HTS Server - Indication for Health Thermometer Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSS_INDICATION_DISABLED,

    /** HTS Server - Health Thermometer Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSS_INDICATION_CONFIRMED,

    /** HTS Server - Write Request for Health Thermometer Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSS_WRITE_CHAR,

    /** HTS Client - Health Thermometer Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSC_NOTIFICATION,

    /** HTS Client - Health Thermometer Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSC_INDICATION,

    /** HTS Client - Read Response for Read Request of Health Thermometer
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSC_READ_CHAR_RESPONSE,

    /** HTS Client - Write Response for Write Request of Health Thermometer
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_hts_char_value_t type.
     */
    CY_BLE_EVT_HTSC_WRITE_CHAR_RESPONSE,

    /** HTS Client - Read Response for Read Request of Health Thermometer
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_hts_descr_value_t type.
     */
    CY_BLE_EVT_HTSC_READ_DESCR_RESPONSE,

    /** HTS Client - Write Response for Write Request of Health Thermometer
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_hts_descr_value_t type.
     */
    CY_BLE_EVT_HTSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Immediate Alert Service Events
     ***************************************/

    /** IAS Server - Write Command Request for Alert Level
     *  Characteristic. The parameter of this event
     *  is a structure of the cy_stc_ble_ias_char_value_t type.
     */
    CY_BLE_EVT_IASS_WRITE_CHAR_CMD,

    /****************************************
     * Indoor Positioning Service Events
     ***************************************/

    /** IPS Server - Read Request for Indoor Positioning Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSS_READ_CHAR,

    /** IPS Server - Write Request for Indoor Positioning Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSS_WRITE_CHAR,

    /** IPS Server - Write command request for Indoor Positioning Service
     *  Characteristic. The parameter of this event
     *  is a structure of the cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSS_WRITE_CHAR_CMD,

    /** IPS Client - Read Response for Read Request of Indoor Positioning
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSC_READ_CHAR_RESPONSE,

    /** IPS Client - Read Multiple Response for Read Multiple Request of
     *  Indoor Positioning Service Characteristic value. The parameter
     *  of this event is a structure of the cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSC_READ_MULTIPLE_CHAR_RESPONSE,

    /** IPS Client - Write Response for Write Request of Indoor Positioning
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSC_WRITE_CHAR_RESPONSE,

    /** IPS Client - Read Response for Read Request of Indoor Positioning
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_ips_descr_value_t type.
     */
    CY_BLE_EVT_IPSC_READ_DESCR_RESPONSE,

    /** IPS Client - Write Response for Write Request of Indoor Positioning
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_ips_descr_value_t type.
     */
    CY_BLE_EVT_IPSC_WRITE_DESCR_RESPONSE,

    /** IPS Client - Error Response for Write Request for Indoor Positioning
     *  Service Characteristic Value. The parameter of this event is a structure of
     *  the cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSC_ERROR_RESPONSE,

