ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** IPS Client - Read Response for Long Read Request of Indoor Positioning
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_ips_char_value_t type.
     */
    CY_BLE_EVT_IPSC_READ_BLOB_RSP,

    /****************************************
     * Link Loss Service Events
     ***************************************/

    /** LLS Server - Write request for Alert Level Characteristic.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_lls_char_value_t type.
     */
    CY_BLE_EVT_LLSS_WRITE_CHAR_REQ,

    /** LLS Client - Read response for Alert Level Characteristic.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_lls_char_value_t type.
     */
    CY_BLE_EVT_LLSC_READ_CHAR_RESPONSE,

    /** LLS Client - Write response for write request of Alert
     *  Level Characteristic. The parameter of this event is a
     *  structure of the cy_stc_ble_lls_char_value_t type.
     */
    CY_BLE_EVT_LLSC_WRITE_CHAR_RESPONSE,


    /****************************************
     * Location and Navigation Service Events
     ***************************************/

    /** LNS Server - Indication for Location and Navigation Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSS_INDICATION_ENABLED,

    /** LNS Server - Indication for Location and Navigation Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSS_INDICATION_DISABLED,

    /** LNS Server - Location and Navigation Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSS_INDICATION_CONFIRMED,

    /** LNS Server - Notification for Location and Navigation Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSS_NOTIFICATION_ENABLED,

    /** LNS Server - Notification for Location and Navigation Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSS_NOTIFICATION_DISABLED,

    /** LNS Server - Write Request for Location and Navigation Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSS_WRITE_CHAR,

    /** LNS Client - Location and Navigation Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSC_INDICATION,

    /** LNS Client - Location and Navigation Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSC_NOTIFICATION,

    /** LNS Client - Read Response for Read Request of Location and Navigation
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSC_READ_CHAR_RESPONSE,

    /** LNS Client - Write Response for Write Request of Location and Navigation
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_lns_char_value_t type.
     */
    CY_BLE_EVT_LNSC_WRITE_CHAR_RESPONSE,

    /** LNS Client - Read Response for Read Request of Location and Navigation
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_lns_descr_value_t type.
     */
    CY_BLE_EVT_LNSC_READ_DESCR_RESPONSE,

    /** LNS Client - Write Response for Write Request of Location and Navigation
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_lns_descr_value_t type.
     */
    CY_BLE_EVT_LNSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Next DST Change Service Events
     ***************************************/

    /** NDCS Client - Read Response for Read Request of Next DST Change
     * Service Characteristic value. The parameter of this event
     * is a structure of the cy_stc_ble_ndcs_char_value_t type.
     */
    CY_BLE_EVT_NDCSC_READ_CHAR_RESPONSE,


    /****************************************
     * Phone Alert Status Service Events
     ***************************************/

    /** PASS Server - Notification for Phone Alert Status Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_pass_char_value_t type.
     */
    CY_BLE_EVT_PASSS_NOTIFICATION_ENABLED,

    /** PASS Server - Notification for Phone Alert Status Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_pass_char_value_t type.
     */
    CY_BLE_EVT_PASSS_NOTIFICATION_DISABLED,

    /** PASS Server - Write Request for Phone Alert Status Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_pass_char_value_t type.
     */
    CY_BLE_EVT_PASSS_WRITE_CHAR,

    /** PASS Client - Phone Alert Status Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_pass_char_value_t type.
     */
    CY_BLE_EVT_PASSC_NOTIFICATION,

    /** PASS Client - Read Response for Read Request of Phone Alert Status
     *  Service Characteristic value. The parameter of this event
     *  is a structure of cy_stc_ble_pass_char_value_t type.
     */
    CY_BLE_EVT_PASSC_READ_CHAR_RESPONSE,

    /** PASS Client - Read Response for Read Request of Phone Alert Status
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_pass_descr_value_t type.
     */
    CY_BLE_EVT_PASSC_READ_DESCR_RESPONSE,

    /** PASS Client - Write Response for Write Request of Phone Alert Status
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_pass_descr_value_t type.
     */
    CY_BLE_EVT_PASSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Pulse Oximeter Service Events
     ***************************************/

