ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** PLXS Server - Indication for Pulse Oximeter Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSS_INDICATION_ENABLED,

    /** PLXS Server - Indication for Pulse Oximeter Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_gls_char_value_t type.
     */
    CY_BLE_EVT_PLXSS_INDICATION_DISABLED,

    /** PLXS Server - Pulse Oximeter Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSS_INDICATION_CONFIRMED,

    /** PLXS Server - Notification for Pulse Oximeter Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSS_NOTIFICATION_ENABLED,

    /** PLXS Server - Notification for Pulse Oximeter Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSS_NOTIFICATION_DISABLED,

    /** PLXS Server - Write Request for Pulse Oximeter Service
     *  was received. The parameter of this event is a structure
     *  of cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSS_WRITE_CHAR,

    /** PLXS Client - Pulse Oximeter Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSC_INDICATION,

    /** PLXS Client - Pulse Oximeter Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSC_NOTIFICATION,

    /** PLXS Client - Read Response for Read Request of Pulse Oximeter
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSC_READ_CHAR_RESPONSE,

    /** PLXS Client - Write Response for Write Request of Pulse Oximeter
     *  Service Characteristic value. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSC_WRITE_CHAR_RESPONSE,

    /** PLXS Client - Read Response for Read Request of Pulse Oximeter
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_plxs_descr_value_t type.
     */
    CY_BLE_EVT_PLXSC_READ_DESCR_RESPONSE,

    /** PLXS Client - Write Response for Write Request of Pulse Oximeter
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_plxs_descr_value_t type.
     */
    CY_BLE_EVT_PLXSC_WRITE_DESCR_RESPONSE,

    /** PLXS Client - PLX RACP procedure timeout was received. The parameter
     *  of this event is a structure of the cy_stc_ble_plxs_char_value_t type.
     */
    CY_BLE_EVT_PLXSC_TIMEOUT,

    /****************************************
     * Running Speed and Cadence Service Events
     ***************************************/

    /** RSCS Server - Notification for Running Speed and Cadence Service
     *  Characteristic was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSS_NOTIFICATION_ENABLED,

    /** RSCS Server - Notification for Running Speed and Cadence Service
     *  Characteristic was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSS_NOTIFICATION_DISABLED,

    /** RSCS Server - Indication for Running Speed and Cadence Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSS_INDICATION_ENABLED,

    /** RSCS Server - Indication for Running Speed and Cadence Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSS_INDICATION_DISABLED,

    /** RSCS Server - Running Speed and Cadence Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSS_INDICATION_CONFIRMATION,

    /** RSCS Server - Write Request for Running Speed and Cadence Service
     *  Characteristic was received. The parameter of this event is a structure
     *  of cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSS_WRITE_CHAR,

    /** RSCS Client - Running Speed and Cadence Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSC_NOTIFICATION,

    /** RSCS Client - Running Speed and Cadence Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSC_INDICATION,

    /** RSCS Client - Read Response for Read Request of Running Speed and Cadence
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSC_READ_CHAR_RESPONSE,

    /** RSCS Client - Write Response for Write Request of Running Speed and Cadence
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_rscs_char_value_t type.
     */
    CY_BLE_EVT_RSCSC_WRITE_CHAR_RESPONSE,

    /** RSCS Client - Read Response for Read Request of Running Speed and Cadence
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_rscs_descr_value_t type.
     */
    CY_BLE_EVT_RSCSC_READ_DESCR_RESPONSE,

