ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** RSCS Client - Write Response for Write Request of Running Speed and Cadence
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_rscs_descr_value_t type.
     */
    CY_BLE_EVT_RSCSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Reference Time Update Service Events
     ***************************************/

    /** RTUS Server - Write command request for Reference Time Update
     *  Characteristic value. The parameter of this event
     *  is a structure of cy_stc_ble_rtus_char_value_t type.
     */
    CY_BLE_EVT_RTUSS_WRITE_CHAR_CMD,

    /** RTUS Client - Read Response for Read Request of Reference Time Update
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_rtus_char_value_t type.
     */
    CY_BLE_EVT_RTUSC_READ_CHAR_RESPONSE,


    /****************************************
     * Scan Parameters Service Events
     ***************************************/

    /** ScPS Server - Notification for Scan Refresh Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_scps_char_value_t type.
     */
    CY_BLE_EVT_SCPSS_NOTIFICATION_ENABLED,

    /** ScPS Server - Notification for Scan Refresh Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_scps_char_value_t type.
     */
    CY_BLE_EVT_SCPSS_NOTIFICATION_DISABLED,

    /** ScPS Client - Read Response for Scan Interval Window
     *  Characteristic Value of Scan Parameters Service. The
     *  parameter of this event is a structure
     *  of the cy_stc_ble_scps_char_value_t type.
     */
    CY_BLE_EVT_SCPSS_SCAN_INT_WIN_WRITE_CHAR,

    /** ScPS Client - Scan Refresh Characteristic Notification
     *  was received. The parameter of this event is a
     *  structure of the cy_stc_ble_scps_char_value_t type.
     */
    CY_BLE_EVT_SCPSC_NOTIFICATION,

    /** ScPS Client - Read Response for Scan Refresh Characteristic
     *  Descriptor Read Request. The parameter of this event is a
     *  structure of the cy_stc_ble_scps_descr_value_t type.
     */
    CY_BLE_EVT_SCPSC_READ_DESCR_RESPONSE,

    /** ScPS Client - Write Response for Scan Refresh Client
     *  Characteristic Configuration Descriptor Value. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_scps_descr_value_t type.
     */
    CY_BLE_EVT_SCPSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * Tx Power Service Events
     ***************************************/

    /** TPS Server - Notification for Tx Power Level Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_tps_char_value_t type.
     */
    CY_BLE_EVT_TPSS_NOTIFICATION_ENABLED,

    /** TPS Server - Notification for Tx Power Level Characteristic
     *  was disabled. The parameter of this event is a structure of
     *  the cy_stc_ble_tps_char_value_t type.
     */
    CY_BLE_EVT_TPSS_NOTIFICATION_DISABLED,

    /** TPS Client - Tx Power Level Characteristic Notification.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_tps_char_value_t type.
     */
    CY_BLE_EVT_TPSC_NOTIFICATION,

    /** TPS Client - Read Response for Tx Power Level Characteristic
     *  Value Read Request. The parameter of this event is a
     *  structure of the cy_stc_ble_tps_char_value_t type.
     */
    CY_BLE_EVT_TPSC_READ_CHAR_RESPONSE,

    /** TPS Client - Read Response for Tx Power Level Client
     *  Characteristic Configuration Descriptor Value Read Request.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_tps_descr_value_t type.
     */
    CY_BLE_EVT_TPSC_READ_DESCR_RESPONSE,

    /** TPS Client - Write Response for Tx Power Level Characteristic
     *  Descriptor Value Write Request. The parameter of this event
     *  is a structure of the cy_stc_ble_tps_descr_value_t type.
     */
    CY_BLE_EVT_TPSC_WRITE_DESCR_RESPONSE,


    /****************************************
     * User Data Service Events
     ***************************************/

    /** UDS Server - Indication for User Data Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSS_INDICATION_ENABLED,

    /** UDS Server - Indication for User Data Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSS_INDICATION_DISABLED,

    /** UDS Server - User Data Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSS_INDICATION_CONFIRMED,

    /** UDS Server - Notification for User Data Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSS_NOTIFICATION_ENABLED,

    /** UDS Server - Notification for User Data Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSS_NOTIFICATION_DISABLED,

    /** UDS Server - Read Request for User Data Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSS_READ_CHAR,

    /** UDS Server - Write Request for User Data Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSS_WRITE_CHAR,

    /** UDS Client - User Data Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSC_INDICATION,

    /** UDS Client - User Data Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSC_NOTIFICATION,

