ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** UDS Client - Read Response for Read Request of User Data
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSC_READ_CHAR_RESPONSE,

    /** UDS Client - Write Response for Write Request of User Data
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSC_WRITE_CHAR_RESPONSE,

    /** UDS Client - Read Response for Read Request of User Data
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_uds_descr_value_t type.
     */
    CY_BLE_EVT_UDSC_READ_DESCR_RESPONSE,

    /** UDS Client - Write Response for Write Request of User Data
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_uds_descr_value_t type.
     */
    CY_BLE_EVT_UDSC_WRITE_DESCR_RESPONSE,

    /** UDS Client - Error Response for Write Request for User Data Service
     *  Characteristic Value. The parameter of this event is a structure of
     *  the cy_stc_ble_uds_char_value_t type.
     */
    CY_BLE_EVT_UDSC_ERROR_RESPONSE,


    /****************************************
    * Wireless Power Transfer Service Events
    ****************************************/

    /** WPTS Server - Notification for Wireless Power Transfer Service Characteristic
     *  was enabled. The parameter of this event is a structure of
     *  the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSS_NOTIFICATION_ENABLED,

    /** WPTS Server - Notification for Wireless Power Transfer Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSS_NOTIFICATION_DISABLED,

    /** WPTS Server - Indication for Wireless Power Transfer Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSS_INDICATION_ENABLED,

    /** WPTS Server - Indication for Wireless Power Transfer Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSS_INDICATION_DISABLED,

    /** WPTS Server - Wireless Power Transfer Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSS_INDICATION_CONFIRMED,

    /** WPTS Server - Write Request for Wireless Power Transfer Service Characteristic
     *  was received. The parameter of this event is a structure
     *  of cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSS_WRITE_CHAR,

    /** WPTS Client - Wireless Power Transfer Service Characteristic
     *  Notification was received. The parameter of this event
     *  is a structure of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSC_NOTIFICATION,

    /** WPTS Client - Wireless Power Transfer Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSC_INDICATION,

    /** WPTS Client - Write Response for Read Request of Wireless Power Transfer
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSC_WRITE_CHAR_RESPONSE,

    /** WPTS Client - Read Response for Read Request of Wireless Power Transfer
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_wpts_char_value_t type.
     */
    CY_BLE_EVT_WPTSC_READ_CHAR_RESPONSE,

    /** WPTS Client - Read Response for Read Request of Wireless Power Transfer
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  the cy_stc_ble_wpts_descr_value_t type.
     */
    CY_BLE_EVT_WPTSC_READ_DESCR_RESPONSE,

    /** WPTS Client - Write Response for Write Request of Wireless Power Transfer
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_wpts_descr_value_t type.
     */
    CY_BLE_EVT_WPTSC_WRITE_DESCR_RESPONSE,


    /****************************************
    *     Weight Scale Service Events
    ****************************************/

    /** WSS Server - Indication for Weight Scale Service Characteristic
     *  was enabled. The parameter of this event is a structure
     *  of the cy_stc_ble_wss_char_value_t type.
     */
    CY_BLE_EVT_WSSS_INDICATION_ENABLED,

    /** WSS Server - Indication for Weight Scale Service Characteristic
     *  was disabled. The parameter of this event is a structure
     *  of the cy_stc_ble_wss_char_value_t type.
     */
    CY_BLE_EVT_WSSS_INDICATION_DISABLED,

    /** WSS Server - Weight Scale Service Characteristic
     *  Indication was confirmed. The parameter of this event
     *  is a structure of the cy_stc_ble_wss_char_value_t type.
     */
    CY_BLE_EVT_WSSS_INDICATION_CONFIRMED,

    /** WSS Client - Weight Scale Service Characteristic
     *  Indication was received. The parameter of this event
     *  is a structure of the cy_stc_ble_wss_char_value_t type.
     */
    CY_BLE_EVT_WSSC_INDICATION,
    /** WSS Client - Read Response for Read Request of Weight Scale
     *  Service Characteristic value. The parameter of this event
     *  is a structure of the cy_stc_ble_wss_char_value_t type.
     */
    CY_BLE_EVT_WSSC_READ_CHAR_RESPONSE,

    /** WSS Client - Read Response for Read Request of Weight Scale
     *  Service Characteristic Descriptor Read request. The
     *  parameter of this event is a structure of
     *  cy_stc_ble_wss_descr_value_t type.
     */
    CY_BLE_EVT_WSSC_READ_DESCR_RESPONSE,

    /** WSS Client - Write Response for Write Request of Weight Scale
     *  Service Characteristic Configuration Descriptor value.
     *  The parameter of this event is a structure of
     *  the cy_stc_ble_wss_descr_value_t type.
     */
    CY_BLE_EVT_WSSC_WRITE_DESCR_RESPONSE,

    /****************************************
    *     Bootloader Service Events
    ****************************************/
    /** BT Server - Notification for Bootloader Service Characteristic
     *  was enabled.
     */
    CY_BLE_EVT_BTSS_NOTIFICATION_ENABLED,

