ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** BT Server - Notification for Bootloader Service Characteristic
     *  was disabled.
     */
    CY_BLE_EVT_BTSS_NOTIFICATION_DISABLED,
    /** BT Server - Write Request event for the Bootloader Service Characteristic.
     *  The parameter of this event is a structure of the cy_stc_ble_bts_char_value_t type.
     */
    CY_BLE_EVT_BTSS_WRITE_REQ,
    /** BT Server - Write Without Response Request event for the Bootloader Service Characteristic.
     *  The parameter of this event is a structure of the cy_stc_ble_bts_char_value_t type.
     */
    CY_BLE_EVT_BTSS_WRITE_CMD_REQ,
    /** Send Prepare Write Response that identifies acknowledgement for
     *  long characteristic value write. The parameter of this event is a structure of
     *  the cy_stc_ble_gatts_prep_write_req_param_t type.
     */
    CY_BLE_EVT_BTSS_PREP_WRITE_REQ,

    /** Execute Write Request for Bootloader Service
     *  Characteristic was received. The parameter of this event is a structure of
     *  the cy_stc_ble_gatts_exec_write_req_t type.
     */
    CY_BLE_EVT_BTSS_EXEC_WRITE_REQ,


    /****************************************
     * Discovery Procedure Events
     ***************************************/

    /** Discovery Services Event. The parameter of this event is a structure of
     *  the cy_stc_ble_disc_srv_info_t type.
     */
    CY_BLE_EVT_GATTC_DISC_SERVICE,

    /** Discovery Includes Event. The parameter of this event is a structure of
     *  the cy_stc_ble_disc_incl_info_t type.
     */
    CY_BLE_EVT_GATTC_DISC_INCL,

    /** Discovery Characteristic Event. The parameter of this event is a structure of
     *  the cy_stc_ble_disc_char_info_t type.
     */
    CY_BLE_EVT_GATTC_DISC_CHAR,

    /** Discovery Descriptors Event. The parameter of this event is a structure of
     *  the cy_stc_ble_disc_descr_info_t type.
     */
    CY_BLE_EVT_GATTC_DISC_DESCR,

    /** Event for run a procedure which returns a possible range of the current
     *  characteristic descriptor. The parameter of this event is a structure
     *  of the cy_stc_ble_disc_range_info_t type.
     */
    CY_BLE_EVT_GATTC_DISC_DESCR_GET_RANGE
}cy_en_ble_evt_t;

/** @} group_service_api_events */

#if (CY_BLE_GATT_ROLE_CLIENT)


/** Service indexes (SRVI) */
typedef enum
{
    CY_BLE_SRVI_GAP,
    CY_BLE_SRVI_GATT,

#ifdef CY_BLE_ANCS_CLIENT
    CY_BLE_SRVI_ANCS,
#endif /* CY_BLE_ANCS_CLIENT */
#ifdef CY_BLE_ANS_CLIENT
    CY_BLE_SRVI_ANS,
#endif /* CY_BLE_ANS_CLIENT */
#ifdef CY_BLE_AIOS_CLIENT
    CY_BLE_SRVI_AIOS,
#endif /* CY_BLE_AIOS_CLIENT */
#ifdef CY_BLE_BAS_CLIENT
    CY_BLE_SRVI_BAS,
    CY_BLE_SRVI_BAS_END = (uint8_t)(CY_BLE_SRVI_BAS) + CY_BLE_BASC_SERVICE_COUNT - 1u,
#endif /* CY_BLE_BAS_CLIENT */
#ifdef CY_BLE_BCS_CLIENT
    CY_BLE_SRVI_BCS,
#endif /* CY_BLE_BCS_CLIENT */
#ifdef CY_BLE_BLS_CLIENT
    CY_BLE_SRVI_BLS,
#endif /* CY_BLE_BLS_CLIENT */
#ifdef CY_BLE_BMS_CLIENT
    CY_BLE_SRVI_BMS,
#endif /* CY_BLE_BMS_CLIENT */
#ifdef CY_BLE_CGMS_CLIENT
    CY_BLE_SRVI_CGMS,
#endif /* CY_BLE_CGMS_CLIENT */
#ifdef CY_BLE_CPS_CLIENT
    CY_BLE_SRVI_CPS,
#endif /* CY_BLE_CPS_CLIENT */
#ifdef CY_BLE_CSCS_CLIENT
    CY_BLE_SRVI_CSCS,
#endif /* CY_BLE_CSCS_CLIENT */
#ifdef CY_BLE_CTS_CLIENT
    CY_BLE_SRVI_CTS,
#endif /* CY_BLE_CTS_CLIENT */
#ifdef CY_BLE_CUSTOM_CLIENT
    CY_BLE_SRVI_CUSTOMS,
    CY_BLE_SRVI_CUSTOMS_END =(uint8_t)(CY_BLE_SRVI_CUSTOMS )+ CY_BLE_CUSTOMC_SERVICE_COUNT - 1u,
#endif /* CY_BLE_CUSTOM_CLIENT */
#ifdef CY_BLE_DIS_CLIENT
    CY_BLE_SRVI_DIS,
#endif /* CY_BLE_DIS_CLIENT */
#ifdef CY_BLE_ESS_CLIENT
    CY_BLE_SRVI_ESS,
#endif /* CY_BLE_ESS_CLIENT */
#ifdef CY_BLE_GLS_CLIENT
    CY_BLE_SRVI_GLS,
#endif /* CY_BLE_GLS_CLIENT */
#ifdef CY_BLE_HIDS_CLIENT
    CY_BLE_SRVI_HIDS,
    CY_BLE_SRVI_HIDS_END = (uint8_t)(CY_BLE_SRVI_HIDS )+ CY_BLE_HIDSC_SERVICE_COUNT - 1u,
#endif /* CY_BLE_HIDS_CLIENT */
#ifdef CY_BLE_HPS_CLIENT
    CY_BLE_SRVI_HPS,
#endif /* CY_BLE_HPS_CLIENT */
#ifdef CY_BLE_HRS_CLIENT
    CY_BLE_SRVI_HRS,
#endif /* CY_BLE_HRS_CLIENT */
#ifdef CY_BLE_HTS_CLIENT
    CY_BLE_SRVI_HTS,
#endif /* CY_BLE_HTS_CLIENT */
#ifdef CY_BLE_IAS_CLIENT
    CY_BLE_SRVI_IAS,
#endif /* CY_BLE_IAS_CLIENT */
#ifdef CY_BLE_IPS_CLIENT
    CY_BLE_SRVI_IPS,
#endif /* CY_BLE_IPS_CLIENT */
#ifdef CY_BLE_LLS_CLIENT
    CY_BLE_SRVI_LLS,
#endif /* CY_BLE_LLS_CLIENT */
#ifdef CY_BLE_LNS_CLIENT
    CY_BLE_SRVI_LNS,
#endif /* CY_BLE_LNS_CLIENT */
#ifdef CY_BLE_NDCS_CLIENT
    CY_BLE_SRVI_NDCS,
#endif /* CY_BLE_NDCS_CLIENT */
#ifdef CY_BLE_IPSS_CLIENT
    CY_BLE_SRVI_IPSS,
#endif /* CY_BLE_IPSS_CLIENT */
#ifdef CY_BLE_PASS_CLIENT
    CY_BLE_SRVI_PASS,
#endif /* CY_BLE_PASS_CLIENT */
#ifdef CY_BLE_PLXS_CLIENT
    CY_BLE_SRVI_PLXS,
#endif /* CY_BLE_PLXS_CLIENT */
#ifdef CY_BLE_RSCS_CLIENT
    CY_BLE_SRVI_RSCS,
#endif /* CY_BLE_RSCS_CLIENT */
#ifdef CY_BLE_RTUS_CLIENT
    CY_BLE_SRVI_RTUS,
#endif /* CY_BLE_RTUS_CLIENT */
#ifdef CY_BLE_SCPS_CLIENT
    CY_BLE_SRVI_SCPS,
#endif /* CY_BLE_SCPS_CLIENT */
#ifdef CY_BLE_TPS_CLIENT
    CY_BLE_SRVI_TPS,
#endif /* CY_BLE_TPS_CLIENT */
#ifdef CY_BLE_UDS_CLIENT
    CY_BLE_SRVI_UDS,
#endif /* CY_BLE_UDS_CLIENT */
#ifdef CY_BLE_WPTS_CLIENT
    CY_BLE_SRVI_WPTS,
#endif /* CY_BLE_WPTS_CLIENT */
#ifdef CY_BLE_WSS_CLIENT
    CY_BLE_SRVI_WSS,
#endif /* CY_BLE_WSS_CLIENT */
    CY_BLE_SRVI_COUNT /**< Total count of services */
}cy_en_ble_srvi_t;

/** Discovery information structure type */
typedef struct
{
    /** AUTO DISCOVERY flag */
    uint8_t  autoDiscoveryFlag;

    /** Counter for discovery procedures */
    uint32_t servCount;

    /** Characteristic Counter for discovery procedures */
    uint32_t charCount;

    /** Discovery included service information, used for 128-bit UUID read response handle
     *  and for continue discovery.
     */
    cy_stc_ble_disc_incl_info_t         inclInfo;

    /** GAP Service characteristics server's GATT DB handles structure */
    cy_stc_ble_gapc_t                   gapc;

    /** GATT Service characteristics server's GATT DB handles structure */
    cy_stc_ble_gattc_t                  gattc;

    /** GATT Attribute Handle Range type */
    cy_stc_ble_gatt_attr_handle_range_t gattcDiscoveryRange;

