ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
    /** Peer device handle index */
    uint32_t                            connIndex;
}cy_stc_ble_discovery_t;


#endif /* CY_BLE_GATT_ROLE_CLIENT */

/***************************************
* Registration Callback
***************************************/

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
typedef cy_en_ble_gatt_err_code_t (* cy_ble_event_handle_t) (uint32_t eventCode, void *eventParam);

/** Registration Service's Event Handler structure type */
typedef struct
{
    /** The array for storing reference to the service's event handler procedure. */
    cy_ble_event_handle_t serviceEventHandler[CY_BLE_MAX_SRVI];

    /** Count of functions in the array */
    uint8_t               count;
} cy_stc_ble_event_handler_t;

/* using: cy_ble_eventHandler.serviceEventHandler(eventCode, eventParam); */

/* Registration Service's Event Handler functions */
cy_en_ble_api_result_t Cy_BLE_RegisterServiceEventHandler(cy_ble_event_handle_t eventHandlerFunc);
cy_en_ble_gatt_err_code_t Cy_BLE_InvokeServiceEventHandler(uint32_t eventCode, void *eventParam);

extern cy_stc_ble_event_handler_t cy_ble_eventHandler;
#endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL*/


/***************************************
* Function Prototypes
***************************************/

/* Event Handler functions */
void Cy_BLE_EventHandler(cy_en_ble_event_t event, void *evParam);
void Cy_BLE_ReadByGroupEventHandler(cy_stc_ble_gattc_read_by_grp_rsp_param_t *eventParam);
void Cy_BLE_ReadByTypeEventHandler(cy_stc_ble_gattc_read_by_type_rsp_param_t *eventParam);
void Cy_BLE_FindInfoEventHandler(cy_stc_ble_gattc_find_info_rsp_param_t *eventParam);
void Cy_BLE_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
void Cy_BLE_LongProcedureEndEventHandler(cy_stc_ble_conn_handle_t connHandle);
void Cy_BLE_NextInclDiscovery(cy_stc_ble_conn_handle_t connHandle, uint8_t incrementIndex);
void Cy_BLE_NextCharDiscovery(cy_stc_ble_conn_handle_t connHandle, uint8_t incrementIndex);
void Cy_BLE_NextCharDscrDiscovery(cy_stc_ble_conn_handle_t connHandle, uint8_t incrementIndex);

/***************************************
* External data references
***************************************/

extern volatile uint8_t cy_ble_busyStatus[CY_BLE_CONN_COUNT];
extern volatile uint32_t cy_ble_cmdStatus;

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
extern uint8_t cy_ble_advertisingIntervalType;
#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)  */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
extern uint8_t cy_ble_scanningIntervalType;
#endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

#if (CY_BLE_GATT_ROLE_CLIENT)
extern cy_stc_ble_discovery_t cy_ble_discovery[CY_BLE_CONFIG_GATTC_COUNT];
extern cy_stc_ble_disc_srvc_info_t cy_ble_serverInfo[CY_BLE_CONFIG_GATTC_COUNT][CY_BLE_SRVI_COUNT];
#endif /* CY_BLE_GATT_ROLE_CLIENT */

/**
 * \addtogroup group_ble_common_api_gatt_functions
 * @{
 */

/******************************************************************************
* Function Name: Cy_BLE_GATT_GetBusyStatus
***************************************************************************//**
*
*  This function returns a status of the BLE stack (busy or not busy).
*  The status is changed after the CY_BLE_EVT_STACK_BUSY_STATUS event.
*
*  \param attId: Identifies the active ATT connection Instance.
*
* \return
*  uint8_t: The busy status.
*   * CY_BLE_STACK_STATE_BUSY - The BLE stack is busy.
*   * CY_BLE_STACK_STATE_FREE - The BLE stack is not busy.
*
******************************************************************************/
#define Cy_BLE_GATT_GetBusyStatus(attId)    (cy_ble_busyStatus[attId])
/** @} group_ble_common_api_gatt_functions */

/**
 * \addtogroup group_ble_common_api_functions
 * @{
 */

/** \cond IGNORE */
/** Macro to check the characteristic handle */
#define CY_BLE_GapcCheckCharHandle(handle, discCharInfo)                     \
    do {                                                                     \
        if((handle) == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)                \
        {                                                                    \
            (handle) = (discCharInfo)->valueHandle;                          \
        }                                                                    \
        else                                                                 \
        {                                                                    \
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DUPLICATION, \
                                &(discCharInfo));                            \
        }                                                                    \
    } while(0)

/** Macro to check and store the characteristic handle */
#define Cy_BLE_CheckStoreCharHandle(handle)                                  \
    do {                                                                     \
        if((handle).valueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)    \
        {                                                                    \
            (handle).valueHandle = discCharInfo->valueHandle;                \
            (handle).properties = discCharInfo->properties;                  \
        }                                                                    \
        else                                                                 \
        {                                                                    \
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DUPLICATION, \
                                &discCharInfo);                              \
        }                                                                    \
    } while(0)

/** Macro to check and store the characteristic descriptor handle */
#define Cy_BLE_CheckStoreCharDescrHandle(handle)                             \
    do {                                                                     \
        if((handle) == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)                \
        {                                                                    \
            (handle) = discDescrInfo->descrHandle;                           \
        }                                                                    \
        else                                                                 \
        {                                                                    \
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DUPLICATION, \
                                &discDescrInfo);                             \
        }                                                                    \
    } while(0)


