ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.h
/******************************************************************************
* Function Name: Cy_BLE_Get16ByPtr
***************************************************************************//**
*
*  Returns the two-bytes value by using a pointer to the LSB.
*
*  \param ptr: Pointer to the LSB of two-bytes data (little-endian).
*
*  \return
*  uint16_t: Two-bytes data.
*
******************************************************************************/
__STATIC_INLINE uint16_t Cy_BLE_Get16ByPtr(const uint8_t ptr[])
{
    return((uint16_t)ptr[0u] | ((uint16_t)(((uint16_t)ptr[1u]) << 8u)));
}


/******************************************************************************
* Function Name: Cy_BLE_Set16ByPtr
***************************************************************************//**
*
*  Sets the two-bytes value by using a pointer to the LSB.
*
*  \param ptr:    Pointer to the LSB of two-bytes data (little-endian).
*  \param value:  Two-bytes data to be written.
*
*  \return
*  None
*
******************************************************************************/
__STATIC_INLINE void Cy_BLE_Set16ByPtr(uint8_t ptr[],
                                       uint16_t value)
{
    ptr[0u] = (uint8_t)value;
    ptr[1u] = (uint8_t)(value >> 8u);
}

/******************************************************************************
* Function Name: Cy_BLE_Get24ByPtr
***************************************************************************//**
*
*  Returns the three-bytes value by using a pointer to the LSB.
*
*  \param ptr: Pointer to the LSB of two-bytes data (little-endian).
*
*  \return
*  uint16_t: Two-bytes data.
*
******************************************************************************/
__STATIC_INLINE uint32_t Cy_BLE_Get24ByPtr(const uint8_t ptr[])
{
    return(((uint32_t)ptr[0u]) | ((uint32_t)(((uint32_t)ptr[1u]) << 8u)) | ((uint32_t)((uint32_t)ptr[2u]) << 16u));
}


/** \endcond */


/***************************************
* Function Prototypes
***************************************/

#if (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT)

uint8_t Cy_BLE_IsDeviceAddressValid(const cy_stc_ble_gap_bd_addr_t *deviceAddress);

#endif /* (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT) */

/** @} group_common_api_functions */

#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* CY_BLE_MODE_PROFILE) */
#endif /* CY_BLE_EVENT_HANDLER_H */


/* [] END OF FILE */
